; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v7 ?v2)
             (pred_12 ?v8 ?v13)
             (pred_1 ?v7 ?v13)
             (pred_3 ?v9 ?v7 )
	     (pred_9 ?v7)
             (pred_4 ?v10)
             (pred_2 ?v8)
             (pred_6 ?v13)
             (pred_5 ?v7)
             (pred_7 ?v8)
             (pred_11 ?v7)
             (pred_8 ))



(:action op_3
:parameters (?v12 ?v6 ?v3 ?v1)
:precondition (and (pred_4 ?v12) (pred_4 ?v6) (pred_2 ?v3) (pred_6 ?v1)
          (pred_10 ?v12 ?v6) (pred_12 ?v3 ?v1)
                   (pred_1 ?v6 ?v1) (pred_9 ?v12) 
                   (pred_5 ?v6) (pred_7 ?v3))
:effect (and  (pred_11 ?v6) (not (pred_5 ?v6))))


(:action op_5
:parameters (?v12 ?v11)
:precondition (and (pred_4 ?v12) (pred_4 ?v11)
               (pred_9 ?v12) (pred_10 ?v12 ?v11) (pred_11 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v12))))

(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_4 ?v12) (pred_2 ?v3) 
                  (pred_9 ?v12) (pred_3 ?v3 ?v12) (pred_8 ))
:effect (and (pred_7 ?v3)
   (not (pred_3 ?v3 ?v12)) (not (pred_8 ))))


(:action op_2
:parameters (?v12 ?v4 ?v5)
:precondition (and (pred_4 ?v12) (pred_2 ?v4) (pred_2 ?v5)
                  (pred_9 ?v12) (pred_7 ?v5) (pred_3 ?v4 ?v12))
:effect (and (pred_7 ?v4) (pred_3 ?v5 ?v12)
        (not (pred_7 ?v5)) (not (pred_3 ?v4 ?v12))))

(:action op_4
:parameters (?v12 ?v3)
:precondition (and (pred_4 ?v12) (pred_2 ?v3) 
                  (pred_9 ?v12) (pred_7 ?v3))
:effect (and (pred_8 ) (pred_3 ?v3 ?v12) (not (pred_7 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_28 obj_02 obj_14 obj_08 obj_04 obj_11 obj_10 obj_07 obj_01 obj_21 obj_32 obj_15 obj_27 obj_31 obj_18 obj_25 obj_17 obj_09 obj_16 obj_24 obj_05 obj_30 obj_12 obj_22 obj_20
    obj_13 obj_26 obj_03
    obj_19 obj_23 obj_06 obj_29
    )

    (:init
       (pred_8)

       (pred_4 obj_28)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_01)
       (pred_4 obj_21)
       (pred_4 obj_32)
       (pred_4 obj_15)
       (pred_4 obj_27)
       (pred_4 obj_31)
       (pred_4 obj_18)
       (pred_4 obj_25)
       (pred_4 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_24)
       (pred_4 obj_05)
       (pred_4 obj_30)
       (pred_4 obj_12)
       (pred_4 obj_22)
       (pred_4 obj_20)
       (pred_6 obj_13)
       (pred_6 obj_26)
       (pred_6 obj_03)
       (pred_2 obj_19)
       (pred_2 obj_23)
       (pred_2 obj_06)
       (pred_2 obj_29)

       (pred_10 obj_28 obj_11)
       (pred_10 obj_28 obj_02)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_28)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_04 obj_21)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_11 obj_32)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_28)
       (pred_10 obj_10 obj_15)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_07 obj_27)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_01 obj_31)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_07)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_32 obj_25)
       (pred_10 obj_32 obj_15)
       (pred_10 obj_32 obj_11)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_27)
       (pred_10 obj_15 obj_10)
       (pred_10 obj_15 obj_32)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_31)
       (pred_10 obj_27 obj_07)
       (pred_10 obj_27 obj_15)
       (pred_10 obj_31 obj_16)
       (pred_10 obj_31 obj_18)
       (pred_10 obj_31 obj_01)
       (pred_10 obj_31 obj_27)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_18 obj_31)
       (pred_10 obj_25 obj_05)
       (pred_10 obj_25 obj_17)
       (pred_10 obj_25 obj_32)
       (pred_10 obj_17 obj_30)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_25)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_09 obj_17)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_16 obj_31)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_24 obj_20)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_05 obj_30)
       (pred_10 obj_05 obj_25)
       (pred_10 obj_30 obj_12)
       (pred_10 obj_30 obj_17)
       (pred_10 obj_30 obj_05)
       (pred_10 obj_12 obj_22)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_30)
       (pred_10 obj_22 obj_20)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_22 obj_12)
       (pred_10 obj_20 obj_24)
       (pred_10 obj_20 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_14)
       (pred_1  obj_01 obj_13)
       (pred_1  obj_15 obj_26)
       (pred_1  obj_12 obj_03)
       (pred_1  obj_14 obj_13)
       (pred_11 obj_28)
       (pred_11 obj_02)
       (pred_11 obj_08)
       (pred_11 obj_04)
       (pred_11 obj_11)
       (pred_11 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_21)
       (pred_11 obj_32)
       (pred_11 obj_27)
       (pred_11 obj_31)
       (pred_11 obj_18)
       (pred_11 obj_25)
       (pred_11 obj_17)
       (pred_11 obj_09)
       (pred_11 obj_16)
       (pred_11 obj_24)
       (pred_11 obj_05)
       (pred_11 obj_30)
       (pred_11 obj_22)
       (pred_11 obj_20)

       (pred_12  obj_19 obj_13)
       (pred_12  obj_23 obj_26)
       (pred_12  obj_06 obj_03)
       (pred_12  obj_29 obj_03)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_23 obj_11)
       (pred_3 obj_06 obj_09)
       (pred_3 obj_29 obj_28)
       (pred_9 obj_09)
    )

    (:goal (and
       (pred_3 obj_23 obj_22)
       (pred_3 obj_29 obj_25)
    ))
(:constraints
  (always (not (pred_9 obj_32)))
)
)

; plan
1. (op_5 obj_09 obj_17)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_17)
   goals met: 0 of 2
2. (op_1 obj_17 obj_19)
   deleted: (pred_3 obj_19 obj_17) (pred_8)
   added: (pred_7 obj_19)
   goals met: 0 of 2
3. (op_5 obj_17 obj_25)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_25)
   goals met: 0 of 2
4. (op_4 obj_25 obj_19)
   deleted: (pred_7 obj_19)
   added: (pred_8) (pred_3 obj_19 obj_25)
   goals met: 0 of 2
5. (op_5 obj_25 obj_17)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_17)
   goals met: 0 of 2
6. (op_5 obj_17 obj_09)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_09)
   goals met: 0 of 2
7. (op_5 obj_09 obj_27)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_27)
   goals met: 0 of 2
8. (op_5 obj_27 obj_07)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_07)
   goals met: 0 of 2
9. (op_5 obj_07 obj_10)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_10)
   goals met: 0 of 2
10. (op_5 obj_10 obj_11)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_11)
   goals met: 0 of 2
11. (op_5 obj_11 obj_28)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_28)
   goals met: 0 of 2
12. (op_1 obj_28 obj_29)
   deleted: (pred_3 obj_29 obj_28) (pred_8)
   added: (pred_7 obj_29)
   goals met: 0 of 2
13. (op_5 obj_28 obj_11)
   deleted: (pred_9 obj_28)
   added: (pred_9 obj_11)
   goals met: 0 of 2
14. (op_5 obj_11 obj_10)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_10)
   goals met: 0 of 2
15. (op_5 obj_10 obj_07)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_07)
   goals met: 0 of 2
16. (op_5 obj_07 obj_27)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_27)
   goals met: 0 of 2
17. (op_5 obj_27 obj_09)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_09)
   goals met: 0 of 2
18. (op_5 obj_09 obj_17)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_17)
   goals met: 0 of 2
19. (op_5 obj_17 obj_25)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_25)
   goals met: 0 of 2
20. (op_4 obj_25 obj_29)
   deleted: (pred_7 obj_29)
   added: (pred_8) (pred_3 obj_29 obj_25)
   goals met: 1 of 2
21. (op_5 obj_25 obj_17)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_17)
   goals met: 1 of 2
22. (op_5 obj_17 obj_09)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_09)
   goals met: 1 of 2
23. (op_5 obj_09 obj_27)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_27)
   goals met: 1 of 2
24. (op_5 obj_27 obj_07)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_07)
   goals met: 1 of 2
25. (op_5 obj_07 obj_10)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_10)
   goals met: 1 of 2
26. (op_5 obj_10 obj_11)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_11)
   goals met: 1 of 2
27. (op_1 obj_11 obj_23)
   deleted: (pred_3 obj_23 obj_11) (pred_8)
   added: (pred_7 obj_23)
   goals met: 1 of 2
28. (op_5 obj_11 obj_10)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_10)
   goals met: 1 of 2
29. (op_5 obj_10 obj_07)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_07)
   goals met: 1 of 2
30. (op_5 obj_07 obj_27)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_27)
   goals met: 1 of 2
31. (op_5 obj_27 obj_31)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_31)
   goals met: 1 of 2
32. (op_5 obj_31 obj_16)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_16)
   goals met: 1 of 2
33. (op_5 obj_16 obj_22)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_22)
   goals met: 1 of 2
34. (op_4 obj_22 obj_23)
   deleted: (pred_7 obj_23)
   added: (pred_8) (pred_3 obj_23 obj_22)
   goals met: 2 of 2
